feilongfl/hal_artery/include/dt-bindings/pinctrl/at32f437v(c-g-m)xx-pinctrl.h
/*
 * Autogenerated file
 *
 * SPDX-License-Identifier: Apache 2.0
 */

#include "at32-af.h"

/* ADC123_IN0 */
#define ADC123_IN0_PA0 \
	AT32_PINMUX_AF('A', 0, ANALOG)

/* ADC123_IN1 */
#define ADC123_IN1_PA1 \
	AT32_PINMUX_AF('A', 1, ANALOG)

/* ADC123_IN10 */
#define ADC123_IN10_PC0 \
	AT32_PINMUX_AF('C', 0, ANALOG)

/* ADC123_IN11 */
#define ADC123_IN11_PC1 \
	AT32_PINMUX_AF('C', 1, ANALOG)

/* ADC123_IN12 */
#define ADC123_IN12_PC2 \
	AT32_PINMUX_AF('C', 2, ANALOG)

/* ADC123_IN13 */
#define ADC123_IN13_PC3 \
	AT32_PINMUX_AF('C', 3, ANALOG)

/* ADC123_IN2 */
#define ADC123_IN2_PA2 \
	AT32_PINMUX_AF('A', 2, ANALOG)

/* ADC123_IN3 */
#define ADC123_IN3_PA3 \
	AT32_PINMUX_AF('A', 3, ANALOG)

/* ADC12_IN14 */
#define ADC12_IN14_PC4 \
	AT32_PINMUX_AF('C', 4, ANALOG)

/* ADC12_IN15 */
#define ADC12_IN15_PC5 \
	AT32_PINMUX_AF('C', 5, ANALOG)

/* ADC12_IN4 */
#define ADC12_IN4_PA4 \
	AT32_PINMUX_AF('A', 4, ANALOG)

/* ADC12_IN5 */
#define ADC12_IN5_PA5 \
	AT32_PINMUX_AF('A', 5, ANALOG)

/* ADC12_IN6 */
#define ADC12_IN6_PA6 \
	AT32_PINMUX_AF('A', 6, ANALOG)

/* ADC12_IN7 */
#define ADC12_IN7_PA7 \
	AT32_PINMUX_AF('A', 7, ANALOG)

/* ADC12_IN8 */
#define ADC12_IN8_PB0 \
	AT32_PINMUX_AF('B', 0, ANALOG)

/* ADC12_IN9 */
#define ADC12_IN9_PB1 \
	AT32_PINMUX_AF('B', 1, ANALOG)

/* ANALOG */
#define ANALOG_PA0 \
	AT32_PINMUX_AF('A', 0, ANALOG)
#define ANALOG_PA1 \
	AT32_PINMUX_AF('A', 1, ANALOG)
#define ANALOG_PA10 \
	AT32_PINMUX_AF('A', 10, ANALOG)
#define ANALOG_PA11 \
	AT32_PINMUX_AF('A', 11, ANALOG)
#define ANALOG_PA12 \
	AT32_PINMUX_AF('A', 12, ANALOG)
#define ANALOG_PA13 \
	AT32_PINMUX_AF('A', 13, ANALOG)
#define ANALOG_PA14 \
	AT32_PINMUX_AF('A', 14, ANALOG)
#define ANALOG_PA15 \
	AT32_PINMUX_AF('A', 15, ANALOG)
#define ANALOG_PA2 \
	AT32_PINMUX_AF('A', 2, ANALOG)
#define ANALOG_PA3 \
	AT32_PINMUX_AF('A', 3, ANALOG)
#define ANALOG_PA4 \
	AT32_PINMUX_AF('A', 4, ANALOG)
#define ANALOG_PA5 \
	AT32_PINMUX_AF('A', 5, ANALOG)
#define ANALOG_PA6 \
	AT32_PINMUX_AF('A', 6, ANALOG)
#define ANALOG_PA7 \
	AT32_PINMUX_AF('A', 7, ANALOG)
#define ANALOG_PA8 \
	AT32_PINMUX_AF('A', 8, ANALOG)
#define ANALOG_PA9 \
	AT32_PINMUX_AF('A', 9, ANALOG)
#define ANALOG_PB0 \
	AT32_PINMUX_AF('B', 0, ANALOG)
#define ANALOG_PB1 \
	AT32_PINMUX_AF('B', 1, ANALOG)
#define ANALOG_PB10 \
	AT32_PINMUX_AF('B', 10, ANALOG)
#define ANALOG_PB11 \
	AT32_PINMUX_AF('B', 11, ANALOG)
#define ANALOG_PB12 \
	AT32_PINMUX_AF('B', 12, ANALOG)
#define ANALOG_PB13 \
	AT32_PINMUX_AF('B', 13, ANALOG)
#define ANALOG_PB14 \
	AT32_PINMUX_AF('B', 14, ANALOG)
#define ANALOG_PB15 \
	AT32_PINMUX_AF('B', 15, ANALOG)
#define ANALOG_PB2 \
	AT32_PINMUX_AF('B', 2, ANALOG)
#define ANALOG_PB3 \
	AT32_PINMUX_AF('B', 3, ANALOG)
#define ANALOG_PB4 \
	AT32_PINMUX_AF('B', 4, ANALOG)
#define ANALOG_PB5 \
	AT32_PINMUX_AF('B', 5, ANALOG)
#define ANALOG_PB6 \
	AT32_PINMUX_AF('B', 6, ANALOG)
#define ANALOG_PB7 \
	AT32_PINMUX_AF('B', 7, ANALOG)
#define ANALOG_PB8 \
	AT32_PINMUX_AF('B', 8, ANALOG)
#define ANALOG_PB9 \
	AT32_PINMUX_AF('B', 9, ANALOG)
#define ANALOG_PC0 \
	AT32_PINMUX_AF('C', 0, ANALOG)
#define ANALOG_PC1 \
	AT32_PINMUX_AF('C', 1, ANALOG)
#define ANALOG_PC10 \
	AT32_PINMUX_AF('C', 10, ANALOG)
#define ANALOG_PC11 \
	AT32_PINMUX_AF('C', 11, ANALOG)
#define ANALOG_PC12 \
	AT32_PINMUX_AF('C', 12, ANALOG)
#define ANALOG_PC13 \
	AT32_PINMUX_AF('C', 13, ANALOG)
#define ANALOG_PC14 \
	AT32_PINMUX_AF('C', 14, ANALOG)
#define ANALOG_PC15 \
	AT32_PINMUX_AF('C', 15, ANALOG)
#define ANALOG_PC2 \
	AT32_PINMUX_AF('C', 2, ANALOG)
#define ANALOG_PC3 \
	AT32_PINMUX_AF('C', 3, ANALOG)
#define ANALOG_PC4 \
	AT32_PINMUX_AF('C', 4, ANALOG)
#define ANALOG_PC5 \
	AT32_PINMUX_AF('C', 5, ANALOG)
#define ANALOG_PC6 \
	AT32_PINMUX_AF('C', 6, ANALOG)
#define ANALOG_PC7 \
	AT32_PINMUX_AF('C', 7, ANALOG)
#define ANALOG_PC8 \
	AT32_PINMUX_AF('C', 8, ANALOG)
#define ANALOG_PC9 \
	AT32_PINMUX_AF('C', 9, ANALOG)
#define ANALOG_PD0 \
	AT32_PINMUX_AF('D', 0, ANALOG)
#define ANALOG_PD1 \
	AT32_PINMUX_AF('D', 1, ANALOG)
#define ANALOG_PD10 \
	AT32_PINMUX_AF('D', 10, ANALOG)
#define ANALOG_PD11 \
	AT32_PINMUX_AF('D', 11, ANALOG)
#define ANALOG_PD12 \
	AT32_PINMUX_AF('D', 12, ANALOG)
#define ANALOG_PD13 \
	AT32_PINMUX_AF('D', 13, ANALOG)
#define ANALOG_PD14 \
	AT32_PINMUX_AF('D', 14, ANALOG)
#define ANALOG_PD15 \
	AT32_PINMUX_AF('D', 15, ANALOG)
#define ANALOG_PD2 \
	AT32_PINMUX_AF('D', 2, ANALOG)
#define ANALOG_PD3 \
	AT32_PINMUX_AF('D', 3, ANALOG)
#define ANALOG_PD4 \
	AT32_PINMUX_AF('D', 4, ANALOG)
#define ANALOG_PD5 \
	AT32_PINMUX_AF('D', 5, ANALOG)
#define ANALOG_PD6 \
	AT32_PINMUX_AF('D', 6, ANALOG)
#define ANALOG_PD7 \
	AT32_PINMUX_AF('D', 7, ANALOG)
#define ANALOG_PD8 \
	AT32_PINMUX_AF('D', 8, ANALOG)
#define ANALOG_PD9 \
	AT32_PINMUX_AF('D', 9, ANALOG)
#define ANALOG_PE2 \
	AT32_PINMUX_AF('E', 2, ANALOG)
#define ANALOG_PE3 \
	AT32_PINMUX_AF('E', 3, ANALOG)
#define ANALOG_PE4 \
	AT32_PINMUX_AF('E', 4, ANALOG)
#define ANALOG_PE5 \
	AT32_PINMUX_AF('E', 5, ANALOG)
#define ANALOG_PE6 \
	AT32_PINMUX_AF('E', 6, ANALOG)
#define ANALOG_PH0 \
	AT32_PINMUX_AF('H', 0, ANALOG)
#define ANALOG_PH1 \
	AT32_PINMUX_AF('H', 1, ANALOG)
#define ANALOG_PH2 \
	AT32_PINMUX_AF('H', 2, ANALOG)
#define ANALOG_PH3 \
	AT32_PINMUX_AF('H', 3, ANALOG)

/* CAN1_RX */
#define CAN1_RX_PA11 \
	AT32_PINMUX_AF('A', 11, AF9)
#define CAN1_RX_PB8 \
	AT32_PINMUX_AF('B', 8, AF9)
#define CAN1_RX_PD0 \
	AT32_PINMUX_AF('D', 0, AF9)

/* CAN1_TX */
#define CAN1_TX_PA12 \
	AT32_PINMUX_AF('A', 12, AF9)
#define CAN1_TX_PB9 \
	AT32_PINMUX_AF('B', 9, AF9)
#define CAN1_TX_PD1 \
	AT32_PINMUX_AF('D', 1, AF9)

/* CAN2_RX */
#define CAN2_RX_PB12 \
	AT32_PINMUX_AF('B', 12, AF9)
#define CAN2_RX_PB5 \
	AT32_PINMUX_AF('B', 5, AF9)

/* CAN2_TX */
#define CAN2_TX_PB13 \
	AT32_PINMUX_AF('B', 13, AF9)
#define CAN2_TX_PB6 \
	AT32_PINMUX_AF('B', 6, AF9)

/* CLKOUT1 */
#define CLKOUT1_PA8 \
	AT32_PINMUX_AF('A', 8, AF0)
#define CLKOUT1_PE4 \
	AT32_PINMUX_AF('E', 4, AF0)

/* CLKOUT2 */
#define CLKOUT2_PC9 \
	AT32_PINMUX_AF('C', 9, AF0)

/* DAC1_OUT */
#define DAC1_OUT_PA4 \
	AT32_PINMUX_AF('A', 4, ANALOG)

/* DAC2_OUT */
#define DAC2_OUT_PA5 \
	AT32_PINMUX_AF('A', 5, ANALOG)

/* DVP_D0 */
#define DVP_D0_PA9 \
	AT32_PINMUX_AF('A', 9, AF13)
#define DVP_D0_PC6 \
	AT32_PINMUX_AF('C', 6, AF13)

/* DVP_D1 */
#define DVP_D1_PA10 \
	AT32_PINMUX_AF('A', 10, AF13)
#define DVP_D1_PC7 \
	AT32_PINMUX_AF('C', 7, AF13)

/* DVP_D10 */
#define DVP_D10_PB5 \
	AT32_PINMUX_AF('B', 5, AF13)
#define DVP_D10_PD6 \
	AT32_PINMUX_AF('D', 6, AF13)

/* DVP_D11 */
#define DVP_D11_PD2 \
	AT32_PINMUX_AF('D', 2, AF13)

