feilongfl/hal_artery/include/dt-bindings/pinctrl/at32f437v(c-g-m)xx-pinctrl.h
/* I2C2_SDA */
#define I2C2_SDA_PA1 \
	AT32_PINMUX_AF('A', 1, AF4)
#define I2C2_SDA_PA12 \
	AT32_PINMUX_AF('A', 12, AF4)
#define I2C2_SDA_PB11 \
	AT32_PINMUX_AF('B', 11, AF4)
#define I2C2_SDA_PB3 \
	AT32_PINMUX_AF('B', 3, AF4)
#define I2C2_SDA_PB9 \
	AT32_PINMUX_AF('B', 9, AF7)
#define I2C2_SDA_PC12 \
	AT32_PINMUX_AF('C', 12, AF4)
#define I2C2_SDA_PD13 \
	AT32_PINMUX_AF('D', 13, AF4)
#define I2C2_SDA_PH3 \
	AT32_PINMUX_AF('H', 3, AF4)

/* I2C2_SMBA */
#define I2C2_SMBA_PB12 \
	AT32_PINMUX_AF('B', 12, AF4)
#define I2C2_SMBA_PD11 \
	AT32_PINMUX_AF('D', 11, AF4)

/* I2C3_SCL */
#define I2C3_SCL_PA8 \
	AT32_PINMUX_AF('A', 8, AF4)
#define I2C3_SCL_PB13 \
	AT32_PINMUX_AF('B', 13, AF7)
#define I2C3_SCL_PB15 \
	AT32_PINMUX_AF('B', 15, AF4)
#define I2C3_SCL_PC0 \
	AT32_PINMUX_AF('C', 0, AF4)
#define I2C3_SCL_PD14 \
	AT32_PINMUX_AF('D', 14, AF4)

/* I2C3_SDA */
#define I2C3_SDA_PB14 \
	AT32_PINMUX_AF('B', 14, AF4)
#define I2C3_SDA_PB4 \
	AT32_PINMUX_AF('B', 4, AF4)
#define I2C3_SDA_PC1 \
	AT32_PINMUX_AF('C', 1, AF4)
#define I2C3_SDA_PC9 \
	AT32_PINMUX_AF('C', 9, AF4)
#define I2C3_SDA_PD15 \
	AT32_PINMUX_AF('D', 15, AF4)

/* I2C3_SMBA */
#define I2C3_SMBA_PA9 \
	AT32_PINMUX_AF('A', 9, AF4)
#define I2C3_SMBA_PB13 \
	AT32_PINMUX_AF('B', 13, AF4)
#define I2C3_SMBA_PB2 \
	AT32_PINMUX_AF('B', 2, AF4)

/* I2S1_CK */
#define I2S1_CK_PA5 \
	AT32_PINMUX_AF('A', 5, AF5)
#define I2S1_CK_PB3 \
	AT32_PINMUX_AF('B', 3, AF5)

/* I2S1_MCK */
#define I2S1_MCK_PB0 \
	AT32_PINMUX_AF('B', 0, AF5)
#define I2S1_MCK_PB6 \
	AT32_PINMUX_AF('B', 6, AF5)
#define I2S1_MCK_PC4 \
	AT32_PINMUX_AF('C', 4, AF5)

/* I2S1_SDEXT */
#define I2S1_SDEXT_PA7 \
	AT32_PINMUX_AF('A', 7, AF5)
#define I2S1_SDEXT_PB5 \
	AT32_PINMUX_AF('B', 5, AF5)

/* I2S1_WS */
#define I2S1_WS_PA15 \
	AT32_PINMUX_AF('A', 15, AF5)
#define I2S1_WS_PA4 \
	AT32_PINMUX_AF('A', 4, AF5)

/* I2S2_CK */
#define I2S2_CK_PA9 \
	AT32_PINMUX_AF('A', 9, AF5)
#define I2S2_CK_PB1 \
	AT32_PINMUX_AF('B', 1, AF6)
#define I2S2_CK_PB10 \
	AT32_PINMUX_AF('B', 10, AF5)
#define I2S2_CK_PB13 \
	AT32_PINMUX_AF('B', 13, AF5)
#define I2S2_CK_PC7 \
	AT32_PINMUX_AF('C', 7, AF5)
#define I2S2_CK_PD1 \
	AT32_PINMUX_AF('D', 1, AF6)
#define I2S2_CK_PD3 \
	AT32_PINMUX_AF('D', 3, AF5)

/* I2S2_MCK */
#define I2S2_MCK_PA3 \
	AT32_PINMUX_AF('A', 3, AF5)
#define I2S2_MCK_PA6 \
	AT32_PINMUX_AF('A', 6, AF6)
#define I2S2_MCK_PC6 \
	AT32_PINMUX_AF('C', 6, AF5)

/* I2S2_SDEXT */
#define I2S2_SDEXT_PA10 \
	AT32_PINMUX_AF('A', 10, AF5)
#define I2S2_SDEXT_PB14 \
	AT32_PINMUX_AF('B', 14, AF6)
#define I2S2_SDEXT_PB15 \
	AT32_PINMUX_AF('B', 15, AF5)
#define I2S2_SDEXT_PC1 \
	AT32_PINMUX_AF('C', 1, AF7)
#define I2S2_SDEXT_PC2 \
	AT32_PINMUX_AF('C', 2, AF6)
#define I2S2_SDEXT_PC3 \
	AT32_PINMUX_AF('C', 3, AF5)
#define I2S2_SDEXT_PD4 \
	AT32_PINMUX_AF('D', 4, AF6)

/* I2S2_WS */
#define I2S2_WS_PA11 \
	AT32_PINMUX_AF('A', 11, AF5)
#define I2S2_WS_PB12 \
	AT32_PINMUX_AF('B', 12, AF5)
#define I2S2_WS_PB9 \
	AT32_PINMUX_AF('B', 9, AF5)
#define I2S2_WS_PD0 \
	AT32_PINMUX_AF('D', 0, AF7)
#define I2S2_WS_PD1 \
	AT32_PINMUX_AF('D', 1, AF7)

/* I2S3_CK */
#define I2S3_CK_PB12 \
	AT32_PINMUX_AF('B', 12, AF7)
#define I2S3_CK_PB3 \
	AT32_PINMUX_AF('B', 3, AF6)
#define I2S3_CK_PC10 \
	AT32_PINMUX_AF('C', 10, AF6)

/* I2S3_MCK */
#define I2S3_MCK_PB10 \
	AT32_PINMUX_AF('B', 10, AF6)
#define I2S3_MCK_PC7 \
	AT32_PINMUX_AF('C', 7, AF6)

/* I2S3_SDEXT */
#define I2S3_SDEXT_PA14 \
	AT32_PINMUX_AF('A', 14, AF6)
#define I2S3_SDEXT_PB0 \
	AT32_PINMUX_AF('B', 0, AF7)
#define I2S3_SDEXT_PB2 \
	AT32_PINMUX_AF('B', 2, AF7)
#define I2S3_SDEXT_PB4 \
	AT32_PINMUX_AF('B', 4, AF7)
#define I2S3_SDEXT_PB5 \
	AT32_PINMUX_AF('B', 5, AF6)
#define I2S3_SDEXT_PC1 \
	AT32_PINMUX_AF('C', 1, AF5)
#define I2S3_SDEXT_PC11 \
	AT32_PINMUX_AF('C', 11, AF5)
#define I2S3_SDEXT_PC12 \
	AT32_PINMUX_AF('C', 12, AF6)
#define I2S3_SDEXT_PD0 \
	AT32_PINMUX_AF('D', 0, AF6)
#define I2S3_SDEXT_PD6 \
	AT32_PINMUX_AF('D', 6, AF5)

/* I2S3_WS */
#define I2S3_WS_PA15 \
	AT32_PINMUX_AF('A', 15, AF6)
#define I2S3_WS_PA4 \
	AT32_PINMUX_AF('A', 4, AF6)

/* I2S4_CK */
#define I2S4_CK_PB13 \
	AT32_PINMUX_AF('B', 13, AF6)
#define I2S4_CK_PB7 \
	AT32_PINMUX_AF('B', 7, AF6)
#define I2S4_CK_PE2 \
	AT32_PINMUX_AF('E', 2, AF5)

/* I2S4_MCK */
#define I2S4_MCK_PA10 \
	AT32_PINMUX_AF('A', 10, AF6)
#define I2S4_MCK_PC8 \
	AT32_PINMUX_AF('C', 8, AF5)

/* I2S4_SDEXT */
#define I2S4_SDEXT_PA1 \
	AT32_PINMUX_AF('A', 1, AF5)
#define I2S4_SDEXT_PB9 \
	AT32_PINMUX_AF('B', 9, AF6)
#define I2S4_SDEXT_PE6 \
	AT32_PINMUX_AF('E', 6, AF5)

/* I2S4_WS */
#define I2S4_WS_PB12 \
	AT32_PINMUX_AF('B', 12, AF6)
#define I2S4_WS_PB6 \
	AT32_PINMUX_AF('B', 6, AF6)
#define I2S4_WS_PE4 \
	AT32_PINMUX_AF('E', 4, AF5)

/* IR_OUT */
#define IR_OUT_PA13 \
	AT32_PINMUX_AF('A', 13, AF1)
#define IR_OUT_PB9 \
	AT32_PINMUX_AF('B', 9, AF0)

/* JNTRST */
#define JNTRST_PB4 \
	AT32_PINMUX_AF('B', 4, AF0)

/* JTCK */
#define JTCK_PA14 \
	AT32_PINMUX_AF('A', 14, AF0)

/* JTDI */
#define JTDI_PA15 \
	AT32_PINMUX_AF('A', 15, AF0)

/* JTDO */
#define JTDO_PB3 \
	AT32_PINMUX_AF('B', 3, AF0)

/* JTMS */
#define JTMS_PA13 \
	AT32_PINMUX_AF('A', 13, AF0)

/* OTG1_D+ */
#define OTG1_D+_PA12 \
	AT32_PINMUX_AF('A', 12, AF10)

/* OTG1_D- */
#define OTG1_D-_PA11 \
	AT32_PINMUX_AF('A', 11, AF10)

/* OTG1_ID */
#define OTG1_ID_PA10 \
	AT32_PINMUX_AF('A', 10, AF10)

/* OTG1_OE */
#define OTG1_OE_PA13 \
	AT32_PINMUX_AF('A', 13, AF10)

/* OTG1_SOF */
#define OTG1_SOF_PA8 \
	AT32_PINMUX_AF('A', 8, AF10)

/* OTG1_VBUS */
#define OTG1_VBUS_PA9 \
	AT32_PINMUX_AF('A', 9, AF10)

/* OTG2_D+ */
#define OTG2_D+_PB15 \
	AT32_PINMUX_AF('B', 15, AF12)

/* OTG2_D- */
#define OTG2_D-_PB14 \
	AT32_PINMUX_AF('B', 14, AF12)

/* OTG2_ID */
#define OTG2_ID_PB12 \
	AT32_PINMUX_AF('B', 12, AF12)

/* OTG2_OE */
#define OTG2_OE_PC9 \
	AT32_PINMUX_AF('C', 9, AF11)

/* OTG2_SOF */
#define OTG2_SOF_PA4 \
	AT32_PINMUX_AF('A', 4, AF12)

/* OTG2_VBUS */
#define OTG2_VBUS_PB13 \
	AT32_PINMUX_AF('B', 13, AF12)

/* QSPI1_CS */
#define QSPI1_CS_PB10 \
	AT32_PINMUX_AF('B', 10, AF9)
#define QSPI1_CS_PB6 \
	AT32_PINMUX_AF('B', 6, AF10)
#define QSPI1_CS_PB9 \
	AT32_PINMUX_AF('B', 9, AF10)
#define QSPI1_CS_PC11 \
	AT32_PINMUX_AF('C', 11, AF9)

/* QSPI1_IO0 */
#define QSPI1_IO0_PA6 \
	AT32_PINMUX_AF('A', 6, AF10)
#define QSPI1_IO0_PB0 \
	AT32_PINMUX_AF('B', 0, AF10)
#define QSPI1_IO0_PB11 \
	AT32_PINMUX_AF('B', 11, AF10)
#define QSPI1_IO0_PC9 \
	AT32_PINMUX_AF('C', 9, AF9)
#define QSPI1_IO0_PD11 \
	AT32_PINMUX_AF('D', 11, AF9)
#define QSPI1_IO0_PH2 \
	AT32_PINMUX_AF('H', 2, AF10)

