feilongfl/hal_artery/include/dt-bindings/pinctrl/at32f437v(c-g-m)xx-pinctrl.h
/* QSPI1_IO1 */
#define QSPI1_IO1_PA7 \
	AT32_PINMUX_AF('A', 7, AF10)
#define QSPI1_IO1_PB10 \
	AT32_PINMUX_AF('B', 10, AF10)
#define QSPI1_IO1_PC10 \
	AT32_PINMUX_AF('C', 10, AF9)
#define QSPI1_IO1_PD12 \
	AT32_PINMUX_AF('D', 12, AF9)
#define QSPI1_IO1_PH3 \
	AT32_PINMUX_AF('H', 3, AF10)

/* QSPI1_IO2 */
#define QSPI1_IO2_PA15 \
	AT32_PINMUX_AF('A', 15, AF10)
#define QSPI1_IO2_PC4 \
	AT32_PINMUX_AF('C', 4, AF10)
#define QSPI1_IO2_PC8 \
	AT32_PINMUX_AF('C', 8, AF9)
#define QSPI1_IO2_PE2 \
	AT32_PINMUX_AF('E', 2, AF9)

/* QSPI1_IO3 */
#define QSPI1_IO3_PA1 \
	AT32_PINMUX_AF('A', 1, AF9)
#define QSPI1_IO3_PB3 \
	AT32_PINMUX_AF('B', 3, AF10)
#define QSPI1_IO3_PC5 \
	AT32_PINMUX_AF('C', 5, AF10)
#define QSPI1_IO3_PD13 \
	AT32_PINMUX_AF('D', 13, AF9)

/* QSPI1_SCK */
#define QSPI1_SCK_PB1 \
	AT32_PINMUX_AF('B', 1, AF9)
#define QSPI1_SCK_PB2 \
	AT32_PINMUX_AF('B', 2, AF9)
#define QSPI1_SCK_PD3 \
	AT32_PINMUX_AF('D', 3, AF9)

/* QSPI2_CS */
#define QSPI2_CS_PB8 \
	AT32_PINMUX_AF('B', 8, AF10)

/* QSPI2_IO0 */
#define QSPI2_IO0_PB0 \
	AT32_PINMUX_AF('B', 0, AF9)

/* QSPI2_IO1 */
#define QSPI2_IO1_PA15 \
	AT32_PINMUX_AF('A', 15, AF9)
#define QSPI2_IO1_PB7 \
	AT32_PINMUX_AF('B', 7, AF9)
#define QSPI2_IO1_PC3 \
	AT32_PINMUX_AF('C', 3, AF9)

/* QSPI2_IO2 */
#define QSPI2_IO2_PA5 \
	AT32_PINMUX_AF('A', 5, AF9)

/* QSPI2_IO3 */
#define QSPI2_IO3_PA3 \
	AT32_PINMUX_AF('A', 3, AF9)

/* QSPI2_SCK */
#define QSPI2_SCK_PB1 \
	AT32_PINMUX_AF('B', 1, AF10)

/* SDIO1_CK */
#define SDIO1_CK_PB15 \
	AT32_PINMUX_AF('B', 15, AF13)
#define SDIO1_CK_PB2 \
	AT32_PINMUX_AF('B', 2, AF12)
#define SDIO1_CK_PC12 \
	AT32_PINMUX_AF('C', 12, AF12)

/* SDIO1_CMD */
#define SDIO1_CMD_PA6 \
	AT32_PINMUX_AF('A', 6, AF12)
#define SDIO1_CMD_PD2 \
	AT32_PINMUX_AF('D', 2, AF12)

/* SDIO1_D0 */
#define SDIO1_D0_PB4 \
	AT32_PINMUX_AF('B', 4, AF12)
#define SDIO1_D0_PB6 \
	AT32_PINMUX_AF('B', 6, AF14)
#define SDIO1_D0_PB7 \
	AT32_PINMUX_AF('B', 7, AF14)
#define SDIO1_D0_PC8 \
	AT32_PINMUX_AF('C', 8, AF12)

/* SDIO1_D1 */
#define SDIO1_D1_PA8 \
	AT32_PINMUX_AF('A', 8, AF12)
#define SDIO1_D1_PB0 \
	AT32_PINMUX_AF('B', 0, AF12)
#define SDIO1_D1_PC9 \
	AT32_PINMUX_AF('C', 9, AF12)

/* SDIO1_D2 */
#define SDIO1_D2_PA9 \
	AT32_PINMUX_AF('A', 9, AF12)
#define SDIO1_D2_PB1 \
	AT32_PINMUX_AF('B', 1, AF12)
#define SDIO1_D2_PC10 \
	AT32_PINMUX_AF('C', 10, AF12)

/* SDIO1_D3 */
#define SDIO1_D3_PB5 \
	AT32_PINMUX_AF('B', 5, AF14)
#define SDIO1_D3_PC11 \
	AT32_PINMUX_AF('C', 11, AF12)

/* SDIO1_D4 */
#define SDIO1_D4_PB8 \
	AT32_PINMUX_AF('B', 8, AF12)

/* SDIO1_D5 */
#define SDIO1_D5_PB9 \
	AT32_PINMUX_AF('B', 9, AF12)

/* SDIO1_D6 */
#define SDIO1_D6_PB14 \
	AT32_PINMUX_AF('B', 14, AF13)
#define SDIO1_D6_PC6 \
	AT32_PINMUX_AF('C', 6, AF12)

/* SDIO1_D7 */
#define SDIO1_D7_PB10 \
	AT32_PINMUX_AF('B', 10, AF12)
#define SDIO1_D7_PC7 \
	AT32_PINMUX_AF('C', 7, AF12)

/* SDIO2_CK */
#define SDIO2_CK_PA2 \
	AT32_PINMUX_AF('A', 2, AF10)
#define SDIO2_CK_PC4 \
	AT32_PINMUX_AF('C', 4, AF13)

/* SDIO2_CMD */
#define SDIO2_CMD_PA3 \
	AT32_PINMUX_AF('A', 3, AF10)
#define SDIO2_CMD_PC5 \
	AT32_PINMUX_AF('C', 5, AF13)

/* SDIO2_D0 */
#define SDIO2_D0_PA4 \
	AT32_PINMUX_AF('A', 4, AF11)
#define SDIO2_D0_PC0 \
	AT32_PINMUX_AF('C', 0, AF10)

/* SDIO2_D1 */
#define SDIO2_D1_PA5 \
	AT32_PINMUX_AF('A', 5, AF11)
#define SDIO2_D1_PC1 \
	AT32_PINMUX_AF('C', 1, AF10)

/* SDIO2_D2 */
#define SDIO2_D2_PA6 \
	AT32_PINMUX_AF('A', 6, AF11)
#define SDIO2_D2_PC2 \
	AT32_PINMUX_AF('C', 2, AF10)

/* SDIO2_D3 */
#define SDIO2_D3_PA7 \
	AT32_PINMUX_AF('A', 7, AF13)
#define SDIO2_D3_PC3 \
	AT32_PINMUX_AF('C', 3, AF10)

/* SDIO2_D4 */
#define SDIO2_D4_PA4 \
	AT32_PINMUX_AF('A', 4, AF10)

/* SDIO2_D5 */
#define SDIO2_D5_PA5 \
	AT32_PINMUX_AF('A', 5, AF10)

/* SDIO2_D6 */
#define SDIO2_D6_PA6 \
	AT32_PINMUX_AF('A', 6, AF14)

/* SDIO2_D7 */
#define SDIO2_D7_PA7 \
	AT32_PINMUX_AF('A', 7, AF14)

/* SPI1_CS */
#define SPI1_CS_PA15 \
	AT32_PINMUX_AF('A', 15, AF5)
#define SPI1_CS_PA4 \
	AT32_PINMUX_AF('A', 4, AF5)

/* SPI1_MISO */
#define SPI1_MISO_PA6 \
	AT32_PINMUX_AF('A', 6, AF5)
#define SPI1_MISO_PB4 \
	AT32_PINMUX_AF('B', 4, AF5)

/* SPI1_MOSI */
#define SPI1_MOSI_PA7 \
	AT32_PINMUX_AF('A', 7, AF5)
#define SPI1_MOSI_PB5 \
	AT32_PINMUX_AF('B', 5, AF5)

/* SPI1_SCK */
#define SPI1_SCK_PA5 \
	AT32_PINMUX_AF('A', 5, AF5)
#define SPI1_SCK_PB3 \
	AT32_PINMUX_AF('B', 3, AF5)

/* SPI2_CS */
#define SPI2_CS_PA11 \
	AT32_PINMUX_AF('A', 11, AF5)
#define SPI2_CS_PB12 \
	AT32_PINMUX_AF('B', 12, AF5)
#define SPI2_CS_PB9 \
	AT32_PINMUX_AF('B', 9, AF5)
#define SPI2_CS_PD0 \
	AT32_PINMUX_AF('D', 0, AF7)
#define SPI2_CS_PD1 \
	AT32_PINMUX_AF('D', 1, AF7)

/* SPI2_MISO */
#define SPI2_MISO_PA12 \
	AT32_PINMUX_AF('A', 12, AF5)
#define SPI2_MISO_PB14 \
	AT32_PINMUX_AF('B', 14, AF5)
#define SPI2_MISO_PC2 \
	AT32_PINMUX_AF('C', 2, AF5)
#define SPI2_MISO_PD3 \
	AT32_PINMUX_AF('D', 3, AF6)

/* SPI2_MOSI */
#define SPI2_MOSI_PA10 \
	AT32_PINMUX_AF('A', 10, AF5)
#define SPI2_MOSI_PB15 \
	AT32_PINMUX_AF('B', 15, AF5)
#define SPI2_MOSI_PC1 \
	AT32_PINMUX_AF('C', 1, AF7)
#define SPI2_MOSI_PC3 \
	AT32_PINMUX_AF('C', 3, AF5)
#define SPI2_MOSI_PD4 \
	AT32_PINMUX_AF('D', 4, AF6)

/* SPI2_SCK */
#define SPI2_SCK_PA9 \
	AT32_PINMUX_AF('A', 9, AF5)
#define SPI2_SCK_PB1 \
	AT32_PINMUX_AF('B', 1, AF6)
#define SPI2_SCK_PB10 \
	AT32_PINMUX_AF('B', 10, AF5)
#define SPI2_SCK_PB13 \
	AT32_PINMUX_AF('B', 13, AF5)
#define SPI2_SCK_PC7 \
	AT32_PINMUX_AF('C', 7, AF5)
#define SPI2_SCK_PD1 \
	AT32_PINMUX_AF('D', 1, AF6)
#define SPI2_SCK_PD3 \
	AT32_PINMUX_AF('D', 3, AF5)

/* SPI3_CS */
#define SPI3_CS_PA15 \
	AT32_PINMUX_AF('A', 15, AF6)
#define SPI3_CS_PA4 \
	AT32_PINMUX_AF('A', 4, AF6)

/* SPI3_MISO */
#define SPI3_MISO_PA13 \
	AT32_PINMUX_AF('A', 13, AF6)
#define SPI3_MISO_PB4 \
	AT32_PINMUX_AF('B', 4, AF6)
#define SPI3_MISO_PC11 \
	AT32_PINMUX_AF('C', 11, AF6)

/* SPI3_MOSI */
#define SPI3_MOSI_PA14 \
	AT32_PINMUX_AF('A', 14, AF6)
#define SPI3_MOSI_PB0 \
	AT32_PINMUX_AF('B', 0, AF7)
#define SPI3_MOSI_PB2 \
	AT32_PINMUX_AF('B', 2, AF7)
#define SPI3_MOSI_PB5 \
	AT32_PINMUX_AF('B', 5, AF6)
#define SPI3_MOSI_PC1 \
	AT32_PINMUX_AF('C', 1, AF5)
#define SPI3_MOSI_PC12 \
	AT32_PINMUX_AF('C', 12, AF6)
#define SPI3_MOSI_PD0 \
	AT32_PINMUX_AF('D', 0, AF6)
#define SPI3_MOSI_PD6 \
	AT32_PINMUX_AF('D', 6, AF5)

/* SPI3_SCK */
#define SPI3_SCK_PB12 \
	AT32_PINMUX_AF('B', 12, AF7)
#define SPI3_SCK_PB3 \
	AT32_PINMUX_AF('B', 3, AF6)
#define SPI3_SCK_PC10 \
	AT32_PINMUX_AF('C', 10, AF6)

