feilongfl/hal_artery/include/dt-bindings/pinctrl/at32f437v(c-g-m)xx-pinctrl.h
/* USART2_CK */
#define USART2_CK_PA4 \
	AT32_PINMUX_AF('A', 4, AF7)
#define USART2_CK_PD7 \
	AT32_PINMUX_AF('D', 7, AF7)

/* USART2_CTS */
#define USART2_CTS_PA0 \
	AT32_PINMUX_AF('A', 0, AF7)
#define USART2_CTS_PD3 \
	AT32_PINMUX_AF('D', 3, AF7)

/* USART2_RTS_DE */
#define USART2_RTS_DE_PA1 \
	AT32_PINMUX_AF('A', 1, AF7)
#define USART2_RTS_DE_PD4 \
	AT32_PINMUX_AF('D', 4, AF7)

/* USART2_RX */
#define USART2_RX_PA15 \
	AT32_PINMUX_AF('A', 15, AF8)
#define USART2_RX_PA3 \
	AT32_PINMUX_AF('A', 3, AF7)
#define USART2_RX_PB0 \
	AT32_PINMUX_AF('B', 0, AF6)
#define USART2_RX_PD6 \
	AT32_PINMUX_AF('D', 6, AF7)

/* USART2_TX */
#define USART2_TX_PA14 \
	AT32_PINMUX_AF('A', 14, AF8)
#define USART2_TX_PA2 \
	AT32_PINMUX_AF('A', 2, AF7)
#define USART2_TX_PA8 \
	AT32_PINMUX_AF('A', 8, AF8)
#define USART2_TX_PD5 \
	AT32_PINMUX_AF('D', 5, AF7)

/* USART3_CK */
#define USART3_CK_PB0 \
	AT32_PINMUX_AF('B', 0, AF8)
#define USART3_CK_PB12 \
	AT32_PINMUX_AF('B', 12, AF8)
#define USART3_CK_PC12 \
	AT32_PINMUX_AF('C', 12, AF7)
#define USART3_CK_PD10 \
	AT32_PINMUX_AF('D', 10, AF7)

/* USART3_CTS */
#define USART3_CTS_PA6 \
	AT32_PINMUX_AF('A', 6, AF7)
#define USART3_CTS_PB13 \
	AT32_PINMUX_AF('B', 13, AF8)
#define USART3_CTS_PD11 \
	AT32_PINMUX_AF('D', 11, AF7)

/* USART3_RTS_DE */
#define USART3_RTS_DE_PB1 \
	AT32_PINMUX_AF('B', 1, AF8)
#define USART3_RTS_DE_PB14 \
	AT32_PINMUX_AF('B', 14, AF7)
#define USART3_RTS_DE_PD12 \
	AT32_PINMUX_AF('D', 12, AF7)
#define USART3_RTS_DE_PD2 \
	AT32_PINMUX_AF('D', 2, AF7)

/* USART3_RX */
#define USART3_RX_PB11 \
	AT32_PINMUX_AF('B', 11, AF7)
#define USART3_RX_PC11 \
	AT32_PINMUX_AF('C', 11, AF7)
#define USART3_RX_PC5 \
	AT32_PINMUX_AF('C', 5, AF7)
#define USART3_RX_PD9 \
	AT32_PINMUX_AF('D', 9, AF7)

/* USART3_TX */
#define USART3_TX_PB10 \
	AT32_PINMUX_AF('B', 10, AF7)
#define USART3_TX_PC10 \
	AT32_PINMUX_AF('C', 10, AF7)
#define USART3_TX_PC4 \
	AT32_PINMUX_AF('C', 4, AF7)
#define USART3_TX_PD8 \
	AT32_PINMUX_AF('D', 8, AF7)

/* USART6_CK */
#define USART6_CK_PC8 \
	AT32_PINMUX_AF('C', 8, AF8)

/* USART6_RX */
#define USART6_RX_PA12 \
	AT32_PINMUX_AF('A', 12, AF8)
#define USART6_RX_PA5 \
	AT32_PINMUX_AF('A', 5, AF8)
#define USART6_RX_PC7 \
	AT32_PINMUX_AF('C', 7, AF8)

/* USART6_TX */
#define USART6_TX_PA11 \
	AT32_PINMUX_AF('A', 11, AF8)
#define USART6_TX_PA4 \
	AT32_PINMUX_AF('A', 4, AF8)
#define USART6_TX_PC6 \
	AT32_PINMUX_AF('C', 6, AF8)

/* XMCALE */
#define XMCALE_PD12 \
	AT32_PINMUX_AF('D', 12, AF12)

/* XMCCLE */
#define XMCCLE_PD11 \
	AT32_PINMUX_AF('D', 11, AF12)

/* XMC_A0 */
#define XMC_A0_PC3 \
	AT32_PINMUX_AF('C', 3, AF14)
#define XMC_A0_PC6 \
	AT32_PINMUX_AF('C', 6, AF10)

/* XMC_A1 */
#define XMC_A1_PC7 \
	AT32_PINMUX_AF('C', 7, AF10)

/* XMC_A10 */
#define XMC_A10_PD5 \
	AT32_PINMUX_AF('D', 5, AF10)

/* XMC_A11 */
#define XMC_A11_PD6 \
	AT32_PINMUX_AF('D', 6, AF10)

/* XMC_A12 */
#define XMC_A12_PD7 \
	AT32_PINMUX_AF('D', 7, AF10)

/* XMC_A14 */
#define XMC_A14_PD11 \
	AT32_PINMUX_AF('D', 11, AF10)

/* XMC_A15 */
#define XMC_A15_PD12 \
	AT32_PINMUX_AF('D', 12, AF10)

/* XMC_A16 */
#define XMC_A16_PD11 \
	AT32_PINMUX_AF('D', 11, AF12)

/* XMC_A17 */
#define XMC_A17_PD12 \
	AT32_PINMUX_AF('D', 12, AF12)

/* XMC_A18 */
#define XMC_A18_PD13 \
	AT32_PINMUX_AF('D', 13, AF12)

/* XMC_A19 */
#define XMC_A19_PE3 \
	AT32_PINMUX_AF('E', 3, AF12)

/* XMC_A2 */
#define XMC_A2_PC8 \
	AT32_PINMUX_AF('C', 8, AF10)

/* XMC_A20 */
#define XMC_A20_PE4 \
	AT32_PINMUX_AF('E', 4, AF12)

/* XMC_A21 */
#define XMC_A21_PE5 \
	AT32_PINMUX_AF('E', 5, AF12)

/* XMC_A22 */
#define XMC_A22_PE6 \
	AT32_PINMUX_AF('E', 6, AF12)

/* XMC_A23 */
#define XMC_A23_PE2 \
	AT32_PINMUX_AF('E', 2, AF12)

/* XMC_A3 */
#define XMC_A3_PC9 \
	AT32_PINMUX_AF('C', 9, AF10)

/* XMC_A4 */
#define XMC_A4_PA8 \
	AT32_PINMUX_AF('A', 8, AF14)

/* XMC_A5 */
#define XMC_A5_PD0 \
	AT32_PINMUX_AF('D', 0, AF10)

/* XMC_A6 */
#define XMC_A6_PD1 \
	AT32_PINMUX_AF('D', 1, AF10)

/* XMC_A7 */
#define XMC_A7_PD2 \
	AT32_PINMUX_AF('D', 2, AF10)

/* XMC_A8 */
#define XMC_A8_PD3 \
	AT32_PINMUX_AF('D', 3, AF10)

/* XMC_A9 */
#define XMC_A9_PD4 \
	AT32_PINMUX_AF('D', 4, AF10)

/* XMC_CLK */
#define XMC_CLK_PD3 \
	AT32_PINMUX_AF('D', 3, AF12)

/* XMC_D0 */
#define XMC_D0_PB14 \
	AT32_PINMUX_AF('B', 14, AF14)
#define XMC_D0_PD14 \
	AT32_PINMUX_AF('D', 14, AF12)

/* XMC_D1 */
#define XMC_D1_PC6 \
	AT32_PINMUX_AF('C', 6, AF14)
#define XMC_D1_PD15 \
	AT32_PINMUX_AF('D', 15, AF12)

/* XMC_D13 */
#define XMC_D13_PB12 \
	AT32_PINMUX_AF('B', 12, AF14)
#define XMC_D13_PD8 \
	AT32_PINMUX_AF('D', 8, AF12)

/* XMC_D14 */
#define XMC_D14_PD9 \
	AT32_PINMUX_AF('D', 9, AF12)

/* XMC_D15 */
#define XMC_D15_PD10 \
	AT32_PINMUX_AF('D', 10, AF12)

/* XMC_D2 */
#define XMC_D2_PC11 \
	AT32_PINMUX_AF('C', 11, AF14)
#define XMC_D2_PD0 \
	AT32_PINMUX_AF('D', 0, AF12)

/* XMC_D3 */
#define XMC_D3_PC12 \
	AT32_PINMUX_AF('C', 12, AF14)
#define XMC_D3_PD1 \
	AT32_PINMUX_AF('D', 1, AF12)

/* XMC_D4 */
#define XMC_D4_PA2 \
	AT32_PINMUX_AF('A', 2, AF14)

/* XMC_D5 */
#define XMC_D5_PA3 \
	AT32_PINMUX_AF('A', 3, AF14)

/* XMC_D6 */
#define XMC_D6_PA4 \
	AT32_PINMUX_AF('A', 4, AF14)

/* XMC_D7 */
#define XMC_D7_PA5 \
	AT32_PINMUX_AF('A', 5, AF14)

/* XMC_NADV */
#define XMC_NADV_PB7 \
	AT32_PINMUX_AF('B', 7, AF12)

/* XMC_NCE2 */
#define XMC_NCE2_PD7 \
	AT32_PINMUX_AF('D', 7, AF12)

/* XMC_NCE3 */
#define XMC_NCE3_PA15 \
	AT32_PINMUX_AF('A', 15, AF12)

/* XMC_NE1 */
#define XMC_NE1_PD7 \
	AT32_PINMUX_AF('D', 7, AF12)

/* XMC_NE2 */
#define XMC_NE2_PA15 \
	AT32_PINMUX_AF('A', 15, AF12)

/* XMC_NE4 */
#define XMC_NE4_PC4 \
	AT32_PINMUX_AF('C', 4, AF14)

/* XMC_NOE */
#define XMC_NOE_PB10 \
	AT32_PINMUX_AF('B', 10, AF14)
#define XMC_NOE_PC5 \
	AT32_PINMUX_AF('C', 5, AF14)
#define XMC_NOE_PD4 \
	AT32_PINMUX_AF('D', 4, AF12)

/* XMC_NWAIT */
#define XMC_NWAIT_PD6 \
	AT32_PINMUX_AF('D', 6, AF12)

/* XMC_NWE */
#define XMC_NWE_PC2 \
	AT32_PINMUX_AF('C', 2, AF14)
#define XMC_NWE_PD2 \
	AT32_PINMUX_AF('D', 2, AF14)
#define XMC_NWE_PD5 \
	AT32_PINMUX_AF('D', 5, AF12)

/* XMC_SDBA0 */
#define XMC_SDBA0_PD11 \
	AT32_PINMUX_AF('D', 11, AF10)

/* XMC_SDBA1 */
#define XMC_SDBA1_PD12 \
	AT32_PINMUX_AF('D', 12, AF10)

/* XMC_SDCKE0 */
#define XMC_SDCKE0_PC3 \
	AT32_PINMUX_AF('C', 3, AF12)
#define XMC_SDCKE0_PC5 \
	AT32_PINMUX_AF('C', 5, AF12)

/* XMC_SDCKE1 */
#define XMC_SDCKE1_PB5 \
	AT32_PINMUX_AF('B', 5, AF12)

/* XMC_SDCS0 */
#define XMC_SDCS0_PC2 \
	AT32_PINMUX_AF('C', 2, AF12)
#define XMC_SDCS0_PC4 \
	AT32_PINMUX_AF('C', 4, AF12)

/* XMC_SDCS1 */
#define XMC_SDCS1_PB6 \
	AT32_PINMUX_AF('B', 6, AF12)

/* XMC_SDNCAS */
#define XMC_SDNCAS_PE2 \
	AT32_PINMUX_AF('E', 2, AF10)

/* XMC_SDNRAS */
#define XMC_SDNRAS_PE6 \
	AT32_PINMUX_AF('E', 6, AF10)

/* XMC_SDNWE */
#define XMC_SDNWE_PA7 \
	AT32_PINMUX_AF('A', 7, AF12)
#define XMC_SDNWE_PC0 \
	AT32_PINMUX_AF('C', 0, AF12)

/* XMC_SD_CLK */
#define XMC_SD_CLK_PD13 \
	AT32_PINMUX_AF('D', 13, AF10)
